Autodesk.Revit.DB.IntersectingElementData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IntersectingElementData.IntersectionVolume
The intersection volume.
Since:
2025

Autodesk.Revit.DB.IntersectingElementData.IntersectedElementId
Id of the intersected element.
Since:
2025

Autodesk.Revit.DB.IntersectingElementData.IntersectingElementId
Id of the intersecting element.
Since:
2025

Autodesk.Revit.DB.IntersectingElementData.IntersectionType
The intersection type.
Since:
2025

Autodesk.Revit.DB.IntersectingElementData
Stores information of an element that intersects with another element
Since:
2025